espressif/esp-idf/components/soc/esp32c61/register/soc/pmu_reg.h
/** PMU_HP_MODEM_SYSCLK_REG register
 *  Control register of the system clocks in HP_MODEM state
 */
#define PMU_HP_MODEM_SYSCLK_REG (DR_REG_PMU_BASE + 0x58)
/** PMU_HP_MODEM_DIG_SYS_CLK_NO_DIV : R/W; bitpos: [26]; default: 0;
 *  Configures whether to enable the clock division for HP_ROOT_CLK in HP_MODEM state.
 */
#define PMU_HP_MODEM_DIG_SYS_CLK_NO_DIV    (BIT(26))
#define PMU_HP_MODEM_DIG_SYS_CLK_NO_DIV_M  (PMU_HP_MODEM_DIG_SYS_CLK_NO_DIV_V << PMU_HP_MODEM_DIG_SYS_CLK_NO_DIV_S)
#define PMU_HP_MODEM_DIG_SYS_CLK_NO_DIV_V  0x00000001U
#define PMU_HP_MODEM_DIG_SYS_CLK_NO_DIV_S  26
/** PMU_HP_MODEM_ICG_SYS_CLOCK_EN : R/W; bitpos: [27]; default: 0;
 *  Configures whether to enable HP_ROOT_CLK in HP_MODEM state.
 *  0: Disable
 *  1: Enable
 */
#define PMU_HP_MODEM_ICG_SYS_CLOCK_EN    (BIT(27))
#define PMU_HP_MODEM_ICG_SYS_CLOCK_EN_M  (PMU_HP_MODEM_ICG_SYS_CLOCK_EN_V << PMU_HP_MODEM_ICG_SYS_CLOCK_EN_S)
#define PMU_HP_MODEM_ICG_SYS_CLOCK_EN_V  0x00000001U
#define PMU_HP_MODEM_ICG_SYS_CLOCK_EN_S  27
/** PMU_HP_MODEM_SYS_CLK_SLP_SEL : R/W; bitpos: [28]; default: 0;
 *  Configures whether to allow PMU to control the clock source in HP_MODEM state.
 *  0: Controlled by PCR registers
 *  1: Controlled by PMU
 */
#define PMU_HP_MODEM_SYS_CLK_SLP_SEL    (BIT(28))
#define PMU_HP_MODEM_SYS_CLK_SLP_SEL_M  (PMU_HP_MODEM_SYS_CLK_SLP_SEL_V << PMU_HP_MODEM_SYS_CLK_SLP_SEL_S)
#define PMU_HP_MODEM_SYS_CLK_SLP_SEL_V  0x00000001U
#define PMU_HP_MODEM_SYS_CLK_SLP_SEL_S  28
/** PMU_HP_MODEM_ICG_SLP_SEL : R/W; bitpos: [29]; default: 0;
 *  Configures whether to allow PMU to control the clock gating in HP_MODEM state.
 *  0: Controlled by PCR registers
 *  1: Controlled by PMU
 */
#define PMU_HP_MODEM_ICG_SLP_SEL    (BIT(29))
#define PMU_HP_MODEM_ICG_SLP_SEL_M  (PMU_HP_MODEM_ICG_SLP_SEL_V << PMU_HP_MODEM_ICG_SLP_SEL_S)
#define PMU_HP_MODEM_ICG_SLP_SEL_V  0x00000001U
#define PMU_HP_MODEM_ICG_SLP_SEL_S  29
/** PMU_HP_MODEM_DIG_SYS_CLK_SEL : R/W; bitpos: [31:30]; default: 0;
 *  Configures the source of HP_ROOT_CLK in HP_MODEM state.
 *  0: XTAL
 *  1: PLL_CLK
 *  2: RC_FAST_CLK
 *  3: Invalid value
 */
#define PMU_HP_MODEM_DIG_SYS_CLK_SEL    0x00000003U
#define PMU_HP_MODEM_DIG_SYS_CLK_SEL_M  (PMU_HP_MODEM_DIG_SYS_CLK_SEL_V << PMU_HP_MODEM_DIG_SYS_CLK_SEL_S)
#define PMU_HP_MODEM_DIG_SYS_CLK_SEL_V  0x00000003U
#define PMU_HP_MODEM_DIG_SYS_CLK_SEL_S  30

/** PMU_HP_MODEM_HP_REGULATOR0_REG register
 *  Control register of HP regulators' power in HP_MODEM state, controlling all settings except drive
 */
#define PMU_HP_MODEM_HP_REGULATOR0_REG (DR_REG_PMU_BASE + 0x5c)
/** PMU_HP_MODEM_HP_REGULATOR_SLP_CONNECT_EN : R/W; bitpos: [15]; default: 1;
 *  need_des
 */
#define PMU_HP_MODEM_HP_REGULATOR_SLP_CONNECT_EN    (BIT(15))
#define PMU_HP_MODEM_HP_REGULATOR_SLP_CONNECT_EN_M  (PMU_HP_MODEM_HP_REGULATOR_SLP_CONNECT_EN_V << PMU_HP_MODEM_HP_REGULATOR_SLP_CONNECT_EN_S)
#define PMU_HP_MODEM_HP_REGULATOR_SLP_CONNECT_EN_V  0x00000001U
#define PMU_HP_MODEM_HP_REGULATOR_SLP_CONNECT_EN_S  15
/** PMU_HP_MODEM_HP_REGULATOR_SLP_MEM_XPD : R/W; bitpos: [16]; default: 1;
 *  Configures whether to enable the secondary regulator powering the HP memory in HP domain in HP_MODEM state.
 *  0: Disable the regulator
 *  1: Enable the regulator
 */
#define PMU_HP_MODEM_HP_REGULATOR_SLP_MEM_XPD    (BIT(16))
#define PMU_HP_MODEM_HP_REGULATOR_SLP_MEM_XPD_M  (PMU_HP_MODEM_HP_REGULATOR_SLP_MEM_XPD_V << PMU_HP_MODEM_HP_REGULATOR_SLP_MEM_XPD_S)
#define PMU_HP_MODEM_HP_REGULATOR_SLP_MEM_XPD_V  0x00000001U
#define PMU_HP_MODEM_HP_REGULATOR_SLP_MEM_XPD_S  16
/** PMU_HP_MODEM_HP_REGULATOR_SLP_LOGIC_XPD : R/W; bitpos: [17]; default: 1;
 *  Configures whether to enable the secondary regulator powering the logic circuit in HP domain in HP_MODEM state.
 *  0: Disable the regulator
 *  1: Enable the regulator
 */
#define PMU_HP_MODEM_HP_REGULATOR_SLP_LOGIC_XPD    (BIT(17))
#define PMU_HP_MODEM_HP_REGULATOR_SLP_LOGIC_XPD_M  (PMU_HP_MODEM_HP_REGULATOR_SLP_LOGIC_XPD_V << PMU_HP_MODEM_HP_REGULATOR_SLP_LOGIC_XPD_S)
#define PMU_HP_MODEM_HP_REGULATOR_SLP_LOGIC_XPD_V  0x00000001U
#define PMU_HP_MODEM_HP_REGULATOR_SLP_LOGIC_XPD_S  17
/** PMU_HP_MODEM_HP_REGULATOR_XPD : R/W; bitpos: [18]; default: 1;
 *  Configures whether to enable the main HP regulator in HP_MODEM state.
 *  0: Disable
 *  1: Enable
 */
#define PMU_HP_MODEM_HP_REGULATOR_XPD    (BIT(18))
#define PMU_HP_MODEM_HP_REGULATOR_XPD_M  (PMU_HP_MODEM_HP_REGULATOR_XPD_V << PMU_HP_MODEM_HP_REGULATOR_XPD_S)
#define PMU_HP_MODEM_HP_REGULATOR_XPD_V  0x00000001U
#define PMU_HP_MODEM_HP_REGULATOR_XPD_S  18
/** PMU_HP_MODEM_HP_REGULATOR_SLP_MEM_DBIAS : R/W; bitpos: [22:19]; default: 12;
 *  Configures the DREG value of the secondary HP regulator powering the HP memory in HP_MODEM state, adjusting its output voltage.
 */
#define PMU_HP_MODEM_HP_REGULATOR_SLP_MEM_DBIAS    0x0000000FU
#define PMU_HP_MODEM_HP_REGULATOR_SLP_MEM_DBIAS_M  (PMU_HP_MODEM_HP_REGULATOR_SLP_MEM_DBIAS_V << PMU_HP_MODEM_HP_REGULATOR_SLP_MEM_DBIAS_S)
#define PMU_HP_MODEM_HP_REGULATOR_SLP_MEM_DBIAS_V  0x0000000FU
#define PMU_HP_MODEM_HP_REGULATOR_SLP_MEM_DBIAS_S  19
/** PMU_HP_MODEM_HP_REGULATOR_SLP_LOGIC_DBIAS : R/W; bitpos: [26:23]; default: 12;
 *  Configures the DREG value of the secondary HP regulator powering the logic circuits in HP domain in HP_MODEM state, adjusting its output voltage.
 */
#define PMU_HP_MODEM_HP_REGULATOR_SLP_LOGIC_DBIAS    0x0000000FU
#define PMU_HP_MODEM_HP_REGULATOR_SLP_LOGIC_DBIAS_M  (PMU_HP_MODEM_HP_REGULATOR_SLP_LOGIC_DBIAS_V << PMU_HP_MODEM_HP_REGULATOR_SLP_LOGIC_DBIAS_S)
#define PMU_HP_MODEM_HP_REGULATOR_SLP_LOGIC_DBIAS_V  0x0000000FU
#define PMU_HP_MODEM_HP_REGULATOR_SLP_LOGIC_DBIAS_S  23
/** PMU_HP_MODEM_HP_REGULATOR_DBIAS : R/W; bitpos: [31:27]; default: 24;
 *  Configures the DREG value of the main HP regulator in HP_MODEM state, adjusting its output voltage.
 */
#define PMU_HP_MODEM_HP_REGULATOR_DBIAS    0x0000001FU
#define PMU_HP_MODEM_HP_REGULATOR_DBIAS_M  (PMU_HP_MODEM_HP_REGULATOR_DBIAS_V << PMU_HP_MODEM_HP_REGULATOR_DBIAS_S)
#define PMU_HP_MODEM_HP_REGULATOR_DBIAS_V  0x0000001FU
#define PMU_HP_MODEM_HP_REGULATOR_DBIAS_S  27

/** PMU_HP_MODEM_HP_REGULATOR1_REG register
 *  Control register of HP regulators' power in HP_MODEM state, controlling drive settings
 */
#define PMU_HP_MODEM_HP_REGULATOR1_REG (DR_REG_PMU_BASE + 0x60)
/** PMU_HP_MODEM_HP_REGULATOR_DRV_B : R/W; bitpos: [31:8]; default: 0;
 *  Configures the drive strength of the main HP regulator in HP_MODEM state.
 */
#define PMU_HP_MODEM_HP_REGULATOR_DRV_B    0x00FFFFFFU
#define PMU_HP_MODEM_HP_REGULATOR_DRV_B_M  (PMU_HP_MODEM_HP_REGULATOR_DRV_B_V << PMU_HP_MODEM_HP_REGULATOR_DRV_B_S)
#define PMU_HP_MODEM_HP_REGULATOR_DRV_B_V  0x00FFFFFFU
#define PMU_HP_MODEM_HP_REGULATOR_DRV_B_S  8

/** PMU_HP_MODEM_XTAL_REG register
 *  XTAL_CLK power control register in HP_MODEM state
 */
#define PMU_HP_MODEM_XTAL_REG (DR_REG_PMU_BASE + 0x64)
/** PMU_HP_MODEM_XPD_XTAL : R/W; bitpos: [31]; default: 1;
 *  Configures whether to enable XTAL_CLK in HP_MODEM state.
 *  0: Disable
 *  1: Enable
 */
#define PMU_HP_MODEM_XPD_XTAL    (BIT(31))
#define PMU_HP_MODEM_XPD_XTAL_M  (PMU_HP_MODEM_XPD_XTAL_V << PMU_HP_MODEM_XPD_XTAL_S)
#define PMU_HP_MODEM_XPD_XTAL_V  0x00000001U
#define PMU_HP_MODEM_XPD_XTAL_S  31

/** PMU_HP_SLEEP_DIG_POWER_REG register
 *  Configuration register of digital power domains in HP_SLEEP state
 */
#define PMU_HP_SLEEP_DIG_POWER_REG (DR_REG_PMU_BASE + 0x68)
/** PMU_HP_SLEEP_VDD_SPI_PD_EN : R/W; bitpos: [21]; default: 0;
 *  Configures whether to power down external flash in HP_SLEEP state.
 *  0: Power up
 *  1: Power down
 */
#define PMU_HP_SLEEP_VDD_SPI_PD_EN    (BIT(21))
#define PMU_HP_SLEEP_VDD_SPI_PD_EN_M  (PMU_HP_SLEEP_VDD_SPI_PD_EN_V << PMU_HP_SLEEP_VDD_SPI_PD_EN_S)
#define PMU_HP_SLEEP_VDD_SPI_PD_EN_V  0x00000001U
#define PMU_HP_SLEEP_VDD_SPI_PD_EN_S  21
/** PMU_HP_SLEEP_HP_MEM_DSLP : R/W; bitpos: [22]; default: 0;
 *  Configures whether to put Internal SRAM$x ($x= 0, 1, 2) into Deep-sleep mode in HP_SLEEP state.
 *  0: Do not put Internal SRAM into Deep-sleep
 *  1: Put Internal SRAM into Deep-sleep
 */
#define PMU_HP_SLEEP_HP_MEM_DSLP    (BIT(22))
#define PMU_HP_SLEEP_HP_MEM_DSLP_M  (PMU_HP_SLEEP_HP_MEM_DSLP_V << PMU_HP_SLEEP_HP_MEM_DSLP_S)
#define PMU_HP_SLEEP_HP_MEM_DSLP_V  0x00000001U
#define PMU_HP_SLEEP_HP_MEM_DSLP_S  22
/** PMU_HP_SLEEP_PD_HP_MEM_PD_EN : R/W; bitpos: [26:23]; default: 0;
 *  need_des
 */
#define PMU_HP_SLEEP_PD_HP_MEM_PD_EN    0x0000000FU
#define PMU_HP_SLEEP_PD_HP_MEM_PD_EN_M  (PMU_HP_SLEEP_PD_HP_MEM_PD_EN_V << PMU_HP_SLEEP_PD_HP_MEM_PD_EN_S)
#define PMU_HP_SLEEP_PD_HP_MEM_PD_EN_V  0x0000000FU
#define PMU_HP_SLEEP_PD_HP_MEM_PD_EN_S  23
/** PMU_HP_SLEEP_PD_HP_WIFI_PD_EN : R/W; bitpos: [27]; default: 0;
 *  Configures whether to power down MODEM domain in HP_SLEEP state.
 *  0: Power up
 *  1: Power down
 */
#define PMU_HP_SLEEP_PD_HP_WIFI_PD_EN    (BIT(27))
#define PMU_HP_SLEEP_PD_HP_WIFI_PD_EN_M  (PMU_HP_SLEEP_PD_HP_WIFI_PD_EN_V << PMU_HP_SLEEP_PD_HP_WIFI_PD_EN_S)
#define PMU_HP_SLEEP_PD_HP_WIFI_PD_EN_V  0x00000001U
#define PMU_HP_SLEEP_PD_HP_WIFI_PD_EN_S  27
/** PMU_HP_SLEEP_PD_HP_PERI_PD_EN : R/W; bitpos: [28]; default: 0;
 *  need_des
 */
#define PMU_HP_SLEEP_PD_HP_PERI_PD_EN    (BIT(28))
#define PMU_HP_SLEEP_PD_HP_PERI_PD_EN_M  (PMU_HP_SLEEP_PD_HP_PERI_PD_EN_V << PMU_HP_SLEEP_PD_HP_PERI_PD_EN_S)
#define PMU_HP_SLEEP_PD_HP_PERI_PD_EN_V  0x00000001U
#define PMU_HP_SLEEP_PD_HP_PERI_PD_EN_S  28
/** PMU_HP_SLEEP_PD_HP_CPU_PD_EN : R/W; bitpos: [29]; default: 0;
 *  Configures whether to power down CPU domain in HP_SLEEP state.
 *  0: Power up
 *  1: Power down
 */
#define PMU_HP_SLEEP_PD_HP_CPU_PD_EN    (BIT(29))
#define PMU_HP_SLEEP_PD_HP_CPU_PD_EN_M  (PMU_HP_SLEEP_PD_HP_CPU_PD_EN_V << PMU_HP_SLEEP_PD_HP_CPU_PD_EN_S)
#define PMU_HP_SLEEP_PD_HP_CPU_PD_EN_V  0x00000001U
#define PMU_HP_SLEEP_PD_HP_CPU_PD_EN_S  29
/** PMU_HP_SLEEP_PD_HP_AON_PD_EN : R/W; bitpos: [30]; default: 0;
 *  Configures whether to power down Modem Power domain in HP_SLEEP state.
 *  0: Power up
 *  1: Power down
 */
#define PMU_HP_SLEEP_PD_HP_AON_PD_EN    (BIT(30))
#define PMU_HP_SLEEP_PD_HP_AON_PD_EN_M  (PMU_HP_SLEEP_PD_HP_AON_PD_EN_V << PMU_HP_SLEEP_PD_HP_AON_PD_EN_S)
#define PMU_HP_SLEEP_PD_HP_AON_PD_EN_V  0x00000001U
#define PMU_HP_SLEEP_PD_HP_AON_PD_EN_S  30
/** PMU_HP_SLEEP_PD_TOP_PD_EN : R/W; bitpos: [31]; default: 0;
 *  Configures whether to power down Peripherals+ROM domain in HP_SLEEP state.
 *  0: Power up
 *  1: Power down
 */
#define PMU_HP_SLEEP_PD_TOP_PD_EN    (BIT(31))
#define PMU_HP_SLEEP_PD_TOP_PD_EN_M  (PMU_HP_SLEEP_PD_TOP_PD_EN_V << PMU_HP_SLEEP_PD_TOP_PD_EN_S)
#define PMU_HP_SLEEP_PD_TOP_PD_EN_V  0x00000001U
#define PMU_HP_SLEEP_PD_TOP_PD_EN_S  31

/** PMU_HP_SLEEP_ICG_HP_FUNC_REG register
 *  Control register of HP system peripherals' function clocks in HP_SLEEP state
 */
#define PMU_HP_SLEEP_ICG_HP_FUNC_REG (DR_REG_PMU_BASE + 0x6c)
/** PMU_HP_SLEEP_DIG_ICG_FUNC_EN : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures whether to enable HP system peripherals' function clock in HP_SLEEP state. For detailed configuration please see Chapter <a href='mod:resclk'>link</a> > Table <a href='tab:clk_pmu_func'>link</a>.
 *  0: Disable
 *  1: Enable
 */
#define PMU_HP_SLEEP_DIG_ICG_FUNC_EN    0xFFFFFFFFU
#define PMU_HP_SLEEP_DIG_ICG_FUNC_EN_M  (PMU_HP_SLEEP_DIG_ICG_FUNC_EN_V << PMU_HP_SLEEP_DIG_ICG_FUNC_EN_S)
#define PMU_HP_SLEEP_DIG_ICG_FUNC_EN_V  0xFFFFFFFFU
#define PMU_HP_SLEEP_DIG_ICG_FUNC_EN_S  0

/** PMU_HP_SLEEP_ICG_HP_APB_REG register
 *  Control register of HP system peripherals' APB clocks in HP_SLEEP state
 */
#define PMU_HP_SLEEP_ICG_HP_APB_REG (DR_REG_PMU_BASE + 0x70)
/** PMU_HP_SLEEP_DIG_ICG_APB_EN : R/W; bitpos: [31:0]; default: 4294967295;
 *  Configures whether to enable HP system peripherals' APB clock in HP_SLEEP state. For detailed configuration please see Chapter <a href='mod:resclk'>link</a> > Table <a href='tab:clk_pmu_apb'>link</a>.
 *  0: Disable
 *  1: Enable
 */
#define PMU_HP_SLEEP_DIG_ICG_APB_EN    0xFFFFFFFFU
#define PMU_HP_SLEEP_DIG_ICG_APB_EN_M  (PMU_HP_SLEEP_DIG_ICG_APB_EN_V << PMU_HP_SLEEP_DIG_ICG_APB_EN_S)
#define PMU_HP_SLEEP_DIG_ICG_APB_EN_V  0xFFFFFFFFU
#define PMU_HP_SLEEP_DIG_ICG_APB_EN_S  0

