espressif/esp-idf/components/soc/esp32c61/register/soc/pmu_reg.h
/** PMU_LP_SLEEP_LP_DIG_POWER_REG register
 *  Configuration register of digital power domains in LP system in LP_SLEEP state
 */
#define PMU_LP_SLEEP_LP_DIG_POWER_REG (DR_REG_PMU_BASE + 0xc0)
/** PMU_LP_SLEEP_LP_MEM_DSLP : R/W; bitpos: [30]; default: 0;
 *  Configures whether to enable Memory Deep-sleep mode for the 320 KB SRAM in LP_SLEEP state.
 *  0: Disable
 *  1: Enable
 */
#define PMU_LP_SLEEP_LP_MEM_DSLP    (BIT(30))
#define PMU_LP_SLEEP_LP_MEM_DSLP_M  (PMU_LP_SLEEP_LP_MEM_DSLP_V << PMU_LP_SLEEP_LP_MEM_DSLP_S)
#define PMU_LP_SLEEP_LP_MEM_DSLP_V  0x00000001U
#define PMU_LP_SLEEP_LP_MEM_DSLP_S  30
/** PMU_LP_SLEEP_PD_LP_PERI_PD_EN : R/W; bitpos: [31]; default: 0;
 *  Configures whether to power down the Peripherals+ROM domain in LP_SLEEP state.
 *  0: Power up
 *  1: Power down
 */
#define PMU_LP_SLEEP_PD_LP_PERI_PD_EN    (BIT(31))
#define PMU_LP_SLEEP_PD_LP_PERI_PD_EN_M  (PMU_LP_SLEEP_PD_LP_PERI_PD_EN_V << PMU_LP_SLEEP_PD_LP_PERI_PD_EN_S)
#define PMU_LP_SLEEP_PD_LP_PERI_PD_EN_V  0x00000001U
#define PMU_LP_SLEEP_PD_LP_PERI_PD_EN_S  31

/** PMU_LP_SLEEP_LP_CK_POWER_REG register
 *  Low-speed clock power control register in LP_SLEEP state
 */
#define PMU_LP_SLEEP_LP_CK_POWER_REG (DR_REG_PMU_BASE + 0xc4)
/** PMU_LP_SLEEP_XPD_XTAL32K : R/W; bitpos: [28]; default: 0;
 *  Configures whether to power up XTAL32K_CLK in LP_SLEEP state.
 *  0: Power down
 *  1: Power up
 */
#define PMU_LP_SLEEP_XPD_XTAL32K    (BIT(28))
#define PMU_LP_SLEEP_XPD_XTAL32K_M  (PMU_LP_SLEEP_XPD_XTAL32K_V << PMU_LP_SLEEP_XPD_XTAL32K_S)
#define PMU_LP_SLEEP_XPD_XTAL32K_V  0x00000001U
#define PMU_LP_SLEEP_XPD_XTAL32K_S  28
/** PMU_LP_SLEEP_XPD_RC32K : R/W; bitpos: [29]; default: 0;
 *  Configures whether to power up RC32K_CLK in LP_SLEEP state.
 *  0: Power down
 *  1: Power up
 */
#define PMU_LP_SLEEP_XPD_RC32K    (BIT(29))
#define PMU_LP_SLEEP_XPD_RC32K_M  (PMU_LP_SLEEP_XPD_RC32K_V << PMU_LP_SLEEP_XPD_RC32K_S)
#define PMU_LP_SLEEP_XPD_RC32K_V  0x00000001U
#define PMU_LP_SLEEP_XPD_RC32K_S  29
/** PMU_LP_SLEEP_XPD_FOSC_CLK : R/W; bitpos: [30]; default: 1;
 *  Configures whether to power up RC_FAST_CLK in LP_SLEEP state.
 *  0: Power down
 *  1: Power up
 */
#define PMU_LP_SLEEP_XPD_FOSC_CLK    (BIT(30))
#define PMU_LP_SLEEP_XPD_FOSC_CLK_M  (PMU_LP_SLEEP_XPD_FOSC_CLK_V << PMU_LP_SLEEP_XPD_FOSC_CLK_S)
#define PMU_LP_SLEEP_XPD_FOSC_CLK_V  0x00000001U
#define PMU_LP_SLEEP_XPD_FOSC_CLK_S  30
/** PMU_LP_SLEEP_PD_OSC_CLK : R/W; bitpos: [31]; default: 0;
 *  Configures whether to power up SOSC_CLK in LP_SLEEP state.
 *  0: Power down
 *  1: Power up
 */
#define PMU_LP_SLEEP_PD_OSC_CLK    (BIT(31))
#define PMU_LP_SLEEP_PD_OSC_CLK_M  (PMU_LP_SLEEP_PD_OSC_CLK_V << PMU_LP_SLEEP_PD_OSC_CLK_S)
#define PMU_LP_SLEEP_PD_OSC_CLK_V  0x00000001U
#define PMU_LP_SLEEP_PD_OSC_CLK_S  31

/** PMU_LP_SLEEP_BIAS_REG register
 *  Control register for operation state of analog circuits (BIAS, DBG, CUR) in LP_SLEEP
 */
#define PMU_LP_SLEEP_BIAS_REG (DR_REG_PMU_BASE + 0xc8)
/** PMU_LP_SLEEP_XPD_BIAS : R/W; bitpos: [25]; default: 0;
 *  Configures the power supply of BIAS in LP_SLEEP state.
 */
#define PMU_LP_SLEEP_XPD_BIAS    (BIT(25))
#define PMU_LP_SLEEP_XPD_BIAS_M  (PMU_LP_SLEEP_XPD_BIAS_V << PMU_LP_SLEEP_XPD_BIAS_S)
#define PMU_LP_SLEEP_XPD_BIAS_V  0x00000001U
#define PMU_LP_SLEEP_XPD_BIAS_S  25
/** PMU_LP_SLEEP_DBG_ATTEN : R/W; bitpos: [29:26]; default: 0;
 *  Configures the degree of attenuation of the analog band gap in LP_SLEEP state.
 */
#define PMU_LP_SLEEP_DBG_ATTEN    0x0000000FU
#define PMU_LP_SLEEP_DBG_ATTEN_M  (PMU_LP_SLEEP_DBG_ATTEN_V << PMU_LP_SLEEP_DBG_ATTEN_S)
#define PMU_LP_SLEEP_DBG_ATTEN_V  0x0000000FU
#define PMU_LP_SLEEP_DBG_ATTEN_S  26
/** PMU_LP_SLEEP_PD_CUR : R/W; bitpos: [30]; default: 0;
 *  Configures the power-down current in LP_SLEEP state.
 */
#define PMU_LP_SLEEP_PD_CUR    (BIT(30))
#define PMU_LP_SLEEP_PD_CUR_M  (PMU_LP_SLEEP_PD_CUR_V << PMU_LP_SLEEP_PD_CUR_S)
#define PMU_LP_SLEEP_PD_CUR_V  0x00000001U
#define PMU_LP_SLEEP_PD_CUR_S  30
/** PMU_LP_SLEEP_BIAS_SLEEP : R/W; bitpos: [31]; default: 0;
 *  Configures the sleep or wakeup status of the BIAS circuit in LP_SLEEP state.
 */
#define PMU_LP_SLEEP_BIAS_SLEEP    (BIT(31))
#define PMU_LP_SLEEP_BIAS_SLEEP_M  (PMU_LP_SLEEP_BIAS_SLEEP_V << PMU_LP_SLEEP_BIAS_SLEEP_S)
#define PMU_LP_SLEEP_BIAS_SLEEP_V  0x00000001U
#define PMU_LP_SLEEP_BIAS_SLEEP_S  31

/** PMU_IMM_HP_CK_POWER_REG register
 *  Software-controlled enable signal for HP clock power on/off
 */
#define PMU_IMM_HP_CK_POWER_REG (DR_REG_PMU_BASE + 0xcc)
/** PMU_TIE_LOW_GLOBAL_BBPLL_ICG : WT; bitpos: [0]; default: 0;
 *  Configures whether to force disable the integrated clock gating (ICG) of PLL clock
 *  0: No effect
 *  1: Force disable
 */
#define PMU_TIE_LOW_GLOBAL_BBPLL_ICG    (BIT(0))
#define PMU_TIE_LOW_GLOBAL_BBPLL_ICG_M  (PMU_TIE_LOW_GLOBAL_BBPLL_ICG_V << PMU_TIE_LOW_GLOBAL_BBPLL_ICG_S)
#define PMU_TIE_LOW_GLOBAL_BBPLL_ICG_V  0x00000001U
#define PMU_TIE_LOW_GLOBAL_BBPLL_ICG_S  0
/** PMU_TIE_LOW_GLOBAL_XTAL_ICG : WT; bitpos: [1]; default: 0;
 *  Configures whether to force disable the integrated clock gating (ICG) of XTAL clock.
 *  0: No effect
 *  1: Force disable
 */
#define PMU_TIE_LOW_GLOBAL_XTAL_ICG    (BIT(1))
#define PMU_TIE_LOW_GLOBAL_XTAL_ICG_M  (PMU_TIE_LOW_GLOBAL_XTAL_ICG_V << PMU_TIE_LOW_GLOBAL_XTAL_ICG_S)
#define PMU_TIE_LOW_GLOBAL_XTAL_ICG_V  0x00000001U
#define PMU_TIE_LOW_GLOBAL_XTAL_ICG_S  1
/** PMU_TIE_LOW_I2C_RETENTION : WT; bitpos: [2]; default: 0;
 *  Configures whether to force the power-on reset (POR) signal for the analog I2C to low, releasing the reset.
 *  0: No effect
 *  1: Force disable
 */
#define PMU_TIE_LOW_I2C_RETENTION    (BIT(2))
#define PMU_TIE_LOW_I2C_RETENTION_M  (PMU_TIE_LOW_I2C_RETENTION_V << PMU_TIE_LOW_I2C_RETENTION_S)
#define PMU_TIE_LOW_I2C_RETENTION_V  0x00000001U
#define PMU_TIE_LOW_I2C_RETENTION_S  2
/** PMU_TIE_LOW_XPD_BB_I2C : WT; bitpos: [3]; default: 0;
 *  Configures whether to force the power-on reset (POR) signal for BB_I2C to low, releasing the reset.
 *  0: No effect
 *  1: Force disable
 */
#define PMU_TIE_LOW_XPD_BB_I2C    (BIT(3))
#define PMU_TIE_LOW_XPD_BB_I2C_M  (PMU_TIE_LOW_XPD_BB_I2C_V << PMU_TIE_LOW_XPD_BB_I2C_S)
#define PMU_TIE_LOW_XPD_BB_I2C_V  0x00000001U
#define PMU_TIE_LOW_XPD_BB_I2C_S  3
/** PMU_TIE_LOW_XPD_BBPLL_I2C : WT; bitpos: [4]; default: 0;
 *  Configures whether to force the power-on reset (POR) signal for BBPLL_I2C to low, releasing the reset.
 *  0: No effect
 *  1: Force disable
 */
#define PMU_TIE_LOW_XPD_BBPLL_I2C    (BIT(4))
#define PMU_TIE_LOW_XPD_BBPLL_I2C_M  (PMU_TIE_LOW_XPD_BBPLL_I2C_V << PMU_TIE_LOW_XPD_BBPLL_I2C_S)
#define PMU_TIE_LOW_XPD_BBPLL_I2C_V  0x00000001U
#define PMU_TIE_LOW_XPD_BBPLL_I2C_S  4
/** PMU_TIE_LOW_XPD_BBPLL : WT; bitpos: [5]; default: 0;
 *  Configures whether to force the power-on reset (POR) signal for BBPLL to low, releasing the reset.
 *  0: No effect
 *  1: Force disable
 */
#define PMU_TIE_LOW_XPD_BBPLL    (BIT(5))
#define PMU_TIE_LOW_XPD_BBPLL_M  (PMU_TIE_LOW_XPD_BBPLL_V << PMU_TIE_LOW_XPD_BBPLL_S)
#define PMU_TIE_LOW_XPD_BBPLL_V  0x00000001U
#define PMU_TIE_LOW_XPD_BBPLL_S  5
/** PMU_TIE_LOW_XPD_XTAL : WT; bitpos: [6]; default: 0;
 *  Configures whether to force the power-on reset (POR) signal for XTAL_CLK to low, releasing the reset.
 *  0: No effect
 *  1: Force disable
 */
#define PMU_TIE_LOW_XPD_XTAL    (BIT(6))
#define PMU_TIE_LOW_XPD_XTAL_M  (PMU_TIE_LOW_XPD_XTAL_V << PMU_TIE_LOW_XPD_XTAL_S)
#define PMU_TIE_LOW_XPD_XTAL_V  0x00000001U
#define PMU_TIE_LOW_XPD_XTAL_S  6
/** PMU_TIE_HIGH_GLOBAL_BBPLL_ICG : WT; bitpos: [25]; default: 0;
 *  Configures whether to force enable the integrated clock gating (ICG) of PLL clock.
 *  0: No effect
 *  1: Force enable
 */
#define PMU_TIE_HIGH_GLOBAL_BBPLL_ICG    (BIT(25))
#define PMU_TIE_HIGH_GLOBAL_BBPLL_ICG_M  (PMU_TIE_HIGH_GLOBAL_BBPLL_ICG_V << PMU_TIE_HIGH_GLOBAL_BBPLL_ICG_S)
#define PMU_TIE_HIGH_GLOBAL_BBPLL_ICG_V  0x00000001U
#define PMU_TIE_HIGH_GLOBAL_BBPLL_ICG_S  25
/** PMU_TIE_HIGH_GLOBAL_XTAL_ICG : WT; bitpos: [26]; default: 0;
 *  Configures whether to force enable the integrated clock gating (ICG) of XTAL clock.
 *  0: No effect
 *  1: Force enable
 */
#define PMU_TIE_HIGH_GLOBAL_XTAL_ICG    (BIT(26))
#define PMU_TIE_HIGH_GLOBAL_XTAL_ICG_M  (PMU_TIE_HIGH_GLOBAL_XTAL_ICG_V << PMU_TIE_HIGH_GLOBAL_XTAL_ICG_S)
#define PMU_TIE_HIGH_GLOBAL_XTAL_ICG_V  0x00000001U
#define PMU_TIE_HIGH_GLOBAL_XTAL_ICG_S  26
/** PMU_TIE_HIGH_I2C_RETENTION : WT; bitpos: [27]; default: 0;
 *  Configures whether to force the power-on reset (POR) signal for the analog I2C to high, putting it into reset.
 *  0: No effect
 *  1: Force enable
 */
#define PMU_TIE_HIGH_I2C_RETENTION    (BIT(27))
#define PMU_TIE_HIGH_I2C_RETENTION_M  (PMU_TIE_HIGH_I2C_RETENTION_V << PMU_TIE_HIGH_I2C_RETENTION_S)
#define PMU_TIE_HIGH_I2C_RETENTION_V  0x00000001U
#define PMU_TIE_HIGH_I2C_RETENTION_S  27
/** PMU_TIE_HIGH_XPD_BB_I2C : WT; bitpos: [28]; default: 0;
 *  Configures whether to force the power-on reset (POR) signal for BB_I2C to high, putting it into reset.
 *  0: No effect
 *  1: Force enable
 */
#define PMU_TIE_HIGH_XPD_BB_I2C    (BIT(28))
#define PMU_TIE_HIGH_XPD_BB_I2C_M  (PMU_TIE_HIGH_XPD_BB_I2C_V << PMU_TIE_HIGH_XPD_BB_I2C_S)
#define PMU_TIE_HIGH_XPD_BB_I2C_V  0x00000001U
#define PMU_TIE_HIGH_XPD_BB_I2C_S  28
/** PMU_TIE_HIGH_XPD_BBPLL_I2C : WT; bitpos: [29]; default: 0;
 *  Configures whether to force the power-on reset (POR) signal for BBPLL_I2C to high, putting it into reset.
 *  0: No effect
 *  1: Force enable
 */
#define PMU_TIE_HIGH_XPD_BBPLL_I2C    (BIT(29))
#define PMU_TIE_HIGH_XPD_BBPLL_I2C_M  (PMU_TIE_HIGH_XPD_BBPLL_I2C_V << PMU_TIE_HIGH_XPD_BBPLL_I2C_S)
#define PMU_TIE_HIGH_XPD_BBPLL_I2C_V  0x00000001U
#define PMU_TIE_HIGH_XPD_BBPLL_I2C_S  29
/** PMU_TIE_HIGH_XPD_BBPLL : WT; bitpos: [30]; default: 0;
 *  Configures whether to force the power-on reset (POR) signal for BBPLL to high, putting it into reset.
 *  0: No effect
 *  1: Force enable
 */
#define PMU_TIE_HIGH_XPD_BBPLL    (BIT(30))
#define PMU_TIE_HIGH_XPD_BBPLL_M  (PMU_TIE_HIGH_XPD_BBPLL_V << PMU_TIE_HIGH_XPD_BBPLL_S)
#define PMU_TIE_HIGH_XPD_BBPLL_V  0x00000001U
#define PMU_TIE_HIGH_XPD_BBPLL_S  30
/** PMU_TIE_HIGH_XPD_XTAL : WT; bitpos: [31]; default: 0;
 *  Configures whether to force the power-on reset (POR) signal for XTAL_CLK to high, putting it into reset.
 *  0: No effect
 *  1: Force enable
 */
#define PMU_TIE_HIGH_XPD_XTAL    (BIT(31))
#define PMU_TIE_HIGH_XPD_XTAL_M  (PMU_TIE_HIGH_XPD_XTAL_V << PMU_TIE_HIGH_XPD_XTAL_S)
#define PMU_TIE_HIGH_XPD_XTAL_V  0x00000001U
#define PMU_TIE_HIGH_XPD_XTAL_S  31

