espressif/esp-idf/components/soc/esp32c61/register/soc/pmu_reg.h
/** PMU_POWER_WAIT_TIMER0_REG register
 *  Software-controlled power-on/off waiting timer for PMU
 */
#define PMU_POWER_WAIT_TIMER0_REG (DR_REG_PMU_BASE + 0xec)
/** PMU_DG_HP_POWERDOWN_TIMER : R/W; bitpos: [13:5]; default: 255;
 *  Configures the wait cycles before powering down HP power domains.
 */
#define PMU_DG_HP_POWERDOWN_TIMER    0x000001FFU
#define PMU_DG_HP_POWERDOWN_TIMER_M  (PMU_DG_HP_POWERDOWN_TIMER_V << PMU_DG_HP_POWERDOWN_TIMER_S)
#define PMU_DG_HP_POWERDOWN_TIMER_V  0x000001FFU
#define PMU_DG_HP_POWERDOWN_TIMER_S  5
/** PMU_DG_HP_POWERUP_TIMER : R/W; bitpos: [22:14]; default: 255;
 *  Configures the wait cycles before waking up HP power domains.
 */
#define PMU_DG_HP_POWERUP_TIMER    0x000001FFU
#define PMU_DG_HP_POWERUP_TIMER_M  (PMU_DG_HP_POWERUP_TIMER_V << PMU_DG_HP_POWERUP_TIMER_S)
#define PMU_DG_HP_POWERUP_TIMER_V  0x000001FFU
#define PMU_DG_HP_POWERUP_TIMER_S  14
/** PMU_DG_HP_PD_WAIT_TIMER : R/W; bitpos: [31:23]; default: 255;
 *  Configures the wait cycles during sleep of HP power domains.
 */
#define PMU_DG_HP_PD_WAIT_TIMER    0x000001FFU
#define PMU_DG_HP_PD_WAIT_TIMER_M  (PMU_DG_HP_PD_WAIT_TIMER_V << PMU_DG_HP_PD_WAIT_TIMER_S)
#define PMU_DG_HP_PD_WAIT_TIMER_V  0x000001FFU
#define PMU_DG_HP_PD_WAIT_TIMER_S  23

/** PMU_POWER_WAIT_TIMER1_REG register
 *  Software-controlled power-on/off waiting timer for LP PERI controlled by PMU
 */
#define PMU_POWER_WAIT_TIMER1_REG (DR_REG_PMU_BASE + 0xf0)
/** PMU_DG_LP_POWERDOWN_TIMER : R/W; bitpos: [15:9]; default: 63;
 *  Configures the wait cycles before powering down LP power domains.
 */
#define PMU_DG_LP_POWERDOWN_TIMER    0x0000007FU
#define PMU_DG_LP_POWERDOWN_TIMER_M  (PMU_DG_LP_POWERDOWN_TIMER_V << PMU_DG_LP_POWERDOWN_TIMER_S)
#define PMU_DG_LP_POWERDOWN_TIMER_V  0x0000007FU
#define PMU_DG_LP_POWERDOWN_TIMER_S  9
/** PMU_DG_LP_POWERUP_TIMER : R/W; bitpos: [22:16]; default: 63;
 *  Configures the wait cycles before waking up LP power domains.
 */
#define PMU_DG_LP_POWERUP_TIMER    0x0000007FU
#define PMU_DG_LP_POWERUP_TIMER_M  (PMU_DG_LP_POWERUP_TIMER_V << PMU_DG_LP_POWERUP_TIMER_S)
#define PMU_DG_LP_POWERUP_TIMER_V  0x0000007FU
#define PMU_DG_LP_POWERUP_TIMER_S  16
/** PMU_DG_LP_PD_WAIT_TIMER : R/W; bitpos: [31:23]; default: 255;
 *  Configures the wait cycles during sleep of LP power domains.
 */
#define PMU_DG_LP_PD_WAIT_TIMER    0x000001FFU
#define PMU_DG_LP_PD_WAIT_TIMER_M  (PMU_DG_LP_PD_WAIT_TIMER_V << PMU_DG_LP_PD_WAIT_TIMER_S)
#define PMU_DG_LP_PD_WAIT_TIMER_V  0x000001FFU
#define PMU_DG_LP_PD_WAIT_TIMER_S  23

/** PMU_POWER_WAIT_TIMER2_REG register
 *  Software-controlled waiting timer for HP, LP ISO and reset in PMU
 */
#define PMU_POWER_WAIT_TIMER2_REG (DR_REG_PMU_BASE + 0xf4)
/** PMU_DG_LP_ISO_WAIT_TIMER : R/W; bitpos: [7:0]; default: 255;
 *  Configures the wait cycles of LP ISO control.
 */
#define PMU_DG_LP_ISO_WAIT_TIMER    0x000000FFU
#define PMU_DG_LP_ISO_WAIT_TIMER_M  (PMU_DG_LP_ISO_WAIT_TIMER_V << PMU_DG_LP_ISO_WAIT_TIMER_S)
#define PMU_DG_LP_ISO_WAIT_TIMER_V  0x000000FFU
#define PMU_DG_LP_ISO_WAIT_TIMER_S  0
/** PMU_DG_LP_RST_WAIT_TIMER : R/W; bitpos: [15:8]; default: 255;
 *  Configures the wait cycles of LP reset control.
 */
#define PMU_DG_LP_RST_WAIT_TIMER    0x000000FFU
#define PMU_DG_LP_RST_WAIT_TIMER_M  (PMU_DG_LP_RST_WAIT_TIMER_V << PMU_DG_LP_RST_WAIT_TIMER_S)
#define PMU_DG_LP_RST_WAIT_TIMER_V  0x000000FFU
#define PMU_DG_LP_RST_WAIT_TIMER_S  8
/** PMU_DG_HP_ISO_WAIT_TIMER : R/W; bitpos: [23:16]; default: 255;
 *  Configures the wait cycles of HP ISO control.
 */
#define PMU_DG_HP_ISO_WAIT_TIMER    0x000000FFU
#define PMU_DG_HP_ISO_WAIT_TIMER_M  (PMU_DG_HP_ISO_WAIT_TIMER_V << PMU_DG_HP_ISO_WAIT_TIMER_S)
#define PMU_DG_HP_ISO_WAIT_TIMER_V  0x000000FFU
#define PMU_DG_HP_ISO_WAIT_TIMER_S  16
/** PMU_DG_HP_RST_WAIT_TIMER : R/W; bitpos: [31:24]; default: 255;
 *  Configures the wait cycles of HP reset control.
 */
#define PMU_DG_HP_RST_WAIT_TIMER    0x000000FFU
#define PMU_DG_HP_RST_WAIT_TIMER_M  (PMU_DG_HP_RST_WAIT_TIMER_V << PMU_DG_HP_RST_WAIT_TIMER_S)
#define PMU_DG_HP_RST_WAIT_TIMER_V  0x000000FFU
#define PMU_DG_HP_RST_WAIT_TIMER_S  24

/** PMU_POWER_PD_TOP_CNTL_REG register
 *  Configuration register for Peripherals+ROM power domain controlled by PMU
 */
#define PMU_POWER_PD_TOP_CNTL_REG (DR_REG_PMU_BASE + 0xf8)
/** PMU_FORCE_TOP_RESET : R/W; bitpos: [0]; default: 0;
 *  Configures whether or not to force reset Peripherals+ROM domain.
 *  0: No effect
 *  1: Force reset
 */
#define PMU_FORCE_TOP_RESET    (BIT(0))
#define PMU_FORCE_TOP_RESET_M  (PMU_FORCE_TOP_RESET_V << PMU_FORCE_TOP_RESET_S)
#define PMU_FORCE_TOP_RESET_V  0x00000001U
#define PMU_FORCE_TOP_RESET_S  0
/** PMU_FORCE_TOP_ISO : R/W; bitpos: [1]; default: 0;
 *  Configures whether or not to enable the force isolation of Peripherals+ROM domain.
 *  0: No effect
 *  1: Enable
 */
#define PMU_FORCE_TOP_ISO    (BIT(1))
#define PMU_FORCE_TOP_ISO_M  (PMU_FORCE_TOP_ISO_V << PMU_FORCE_TOP_ISO_S)
#define PMU_FORCE_TOP_ISO_V  0x00000001U
#define PMU_FORCE_TOP_ISO_S  1
/** PMU_FORCE_TOP_PU : R/W; bitpos: [2]; default: 1;
 *  Configures whether or not to force power up Peripherals+ROM domain. This setting has a lower priority than PMU_PD_TOP_MASK.
 *  0: No effect
 *  1: Force power up
 */
#define PMU_FORCE_TOP_PU    (BIT(2))
#define PMU_FORCE_TOP_PU_M  (PMU_FORCE_TOP_PU_V << PMU_FORCE_TOP_PU_S)
#define PMU_FORCE_TOP_PU_V  0x00000001U
#define PMU_FORCE_TOP_PU_S  2
/** PMU_FORCE_TOP_NO_RESET : R/W; bitpos: [3]; default: 1;
 *  Configures whether or not to forcefully prevent the reset of Peripherals+ROM domain. This setting has a lower priority than PMU_FORCE_TOP_RESET.
 *  0: No effect
 *  1: Force not reset
 */
#define PMU_FORCE_TOP_NO_RESET    (BIT(3))
#define PMU_FORCE_TOP_NO_RESET_M  (PMU_FORCE_TOP_NO_RESET_V << PMU_FORCE_TOP_NO_RESET_S)
#define PMU_FORCE_TOP_NO_RESET_V  0x00000001U
#define PMU_FORCE_TOP_NO_RESET_S  3
/** PMU_FORCE_TOP_NO_ISO : R/W; bitpos: [4]; default: 1;
 *  Configures whether or not to disable the force isolation of Peripherals+ROM domain. This setting has a lower priority than PMU_FORCE_TOP_ISO.
 *  0: No effect
 *  1: Disable
 */
#define PMU_FORCE_TOP_NO_ISO    (BIT(4))
#define PMU_FORCE_TOP_NO_ISO_M  (PMU_FORCE_TOP_NO_ISO_V << PMU_FORCE_TOP_NO_ISO_S)
#define PMU_FORCE_TOP_NO_ISO_V  0x00000001U
#define PMU_FORCE_TOP_NO_ISO_S  4
/** PMU_FORCE_TOP_PD : R/W; bitpos: [5]; default: 0;
 *  Configures whether or not to force power down Peripherals+ROM domain. This setting has a lower priority than PMU_FORCE_TOP_PU.
 *  0: No effect
 *  1: Force power down
 */
#define PMU_FORCE_TOP_PD    (BIT(5))
#define PMU_FORCE_TOP_PD_M  (PMU_FORCE_TOP_PD_V << PMU_FORCE_TOP_PD_S)
#define PMU_FORCE_TOP_PD_V  0x00000001U
#define PMU_FORCE_TOP_PD_S  5
/** PMU_PD_TOP_MASK : R/W; bitpos: [10:6]; default: 0;
 *  Configures whether or not to force power up Peripherals+ROM domain, regardless the signals from PMU.
 *  0: No effect
 *  1: Force power up
 */
#define PMU_PD_TOP_MASK    0x0000001FU
#define PMU_PD_TOP_MASK_M  (PMU_PD_TOP_MASK_V << PMU_PD_TOP_MASK_S)
#define PMU_PD_TOP_MASK_V  0x0000001FU
#define PMU_PD_TOP_MASK_S  6
/** PMU_PD_TOP_PD_MASK : R/W; bitpos: [31:27]; default: 0;
 *  Configures whether or not to force power down Peripherals+ROM domain, regardless the signals from PMU. This setting has a lower priority than PMU_PD_TOP_MASK.
 *  0: No effect
 *  1: Force power up
 */
#define PMU_PD_TOP_PD_MASK    0x0000001FU
#define PMU_PD_TOP_PD_MASK_M  (PMU_PD_TOP_PD_MASK_V << PMU_PD_TOP_PD_MASK_S)
#define PMU_PD_TOP_PD_MASK_V  0x0000001FU
#define PMU_PD_TOP_PD_MASK_S  27

/** PMU_POWER_PD_HPAON_CNTL_REG register
 *  Configuration register for Modem Power power domain controlled by PMU
 */
#define PMU_POWER_PD_HPAON_CNTL_REG (DR_REG_PMU_BASE + 0xfc)
/** PMU_FORCE_HP_AON_RESET : R/W; bitpos: [0]; default: 0;
 *  Configures whether or not to force reset Modem Power domain.
 *  0: No effect
 *  1: Force reset
 */
#define PMU_FORCE_HP_AON_RESET    (BIT(0))
#define PMU_FORCE_HP_AON_RESET_M  (PMU_FORCE_HP_AON_RESET_V << PMU_FORCE_HP_AON_RESET_S)
#define PMU_FORCE_HP_AON_RESET_V  0x00000001U
#define PMU_FORCE_HP_AON_RESET_S  0
/** PMU_FORCE_HP_AON_ISO : R/W; bitpos: [1]; default: 0;
 *  Configures whether or not to enable the force isolation of Modem Power domain.
 *  0: No effect
 *  1: Enable
 */
#define PMU_FORCE_HP_AON_ISO    (BIT(1))
#define PMU_FORCE_HP_AON_ISO_M  (PMU_FORCE_HP_AON_ISO_V << PMU_FORCE_HP_AON_ISO_S)
#define PMU_FORCE_HP_AON_ISO_V  0x00000001U
#define PMU_FORCE_HP_AON_ISO_S  1
/** PMU_FORCE_HP_AON_PU : R/W; bitpos: [2]; default: 1;
 *  Configures whether or not to force power up Modem Power domain. This setting has a lower priority than PMU_PD_HP_AON_MASK.
 *  0: No effect
 *  1: Force power up
 */
#define PMU_FORCE_HP_AON_PU    (BIT(2))
#define PMU_FORCE_HP_AON_PU_M  (PMU_FORCE_HP_AON_PU_V << PMU_FORCE_HP_AON_PU_S)
#define PMU_FORCE_HP_AON_PU_V  0x00000001U
#define PMU_FORCE_HP_AON_PU_S  2
/** PMU_FORCE_HP_AON_NO_RESET : R/W; bitpos: [3]; default: 1;
 *  Configures whether or not to forcefully prevent the reset of Modem Power domain. This setting has a lower priority than PMU_FORCE_HP_AON_RESET.
 *  0: No effect
 *  1: Force not reset
 */
#define PMU_FORCE_HP_AON_NO_RESET    (BIT(3))
#define PMU_FORCE_HP_AON_NO_RESET_M  (PMU_FORCE_HP_AON_NO_RESET_V << PMU_FORCE_HP_AON_NO_RESET_S)
#define PMU_FORCE_HP_AON_NO_RESET_V  0x00000001U
#define PMU_FORCE_HP_AON_NO_RESET_S  3
/** PMU_FORCE_HP_AON_NO_ISO : R/W; bitpos: [4]; default: 1;
 *  Configures whether or not to disable the force isolation of Modem Power domain. This setting has a lower priority than PMU_FORCE_HP_AON_ISO.
 *  0: No effect
 *  1: Disable
 */
#define PMU_FORCE_HP_AON_NO_ISO    (BIT(4))
#define PMU_FORCE_HP_AON_NO_ISO_M  (PMU_FORCE_HP_AON_NO_ISO_V << PMU_FORCE_HP_AON_NO_ISO_S)
#define PMU_FORCE_HP_AON_NO_ISO_V  0x00000001U
#define PMU_FORCE_HP_AON_NO_ISO_S  4
/** PMU_FORCE_HP_AON_PD : R/W; bitpos: [5]; default: 0;
 *  Configures whether or not to force power down Modem Power domain. This setting has a lower priority than PMU_FORCE_HP_AON_PU.
 *  0: No effect
 *  1: Force power down
 */
#define PMU_FORCE_HP_AON_PD    (BIT(5))
#define PMU_FORCE_HP_AON_PD_M  (PMU_FORCE_HP_AON_PD_V << PMU_FORCE_HP_AON_PD_S)
#define PMU_FORCE_HP_AON_PD_V  0x00000001U
#define PMU_FORCE_HP_AON_PD_S  5
/** PMU_PD_HP_AON_MASK : R/W; bitpos: [10:6]; default: 0;
 *  Configures whether or not to force power up Modem Power domain, regardless the signals from PMU.
 *  0: No effect
 *  1: Force power up
 */
#define PMU_PD_HP_AON_MASK    0x0000001FU
#define PMU_PD_HP_AON_MASK_M  (PMU_PD_HP_AON_MASK_V << PMU_PD_HP_AON_MASK_S)
#define PMU_PD_HP_AON_MASK_V  0x0000001FU
#define PMU_PD_HP_AON_MASK_S  6
/** PMU_PD_HP_AON_PD_MASK : R/W; bitpos: [31:27]; default: 0;
 *  Configures whether or not to force power down Modem Power domain, regardless the signals from PMU. This setting has a lower priority than PMU_PD_HP_AON_MASK.
 *  0: No effect
 *  1: Force power up
 */
#define PMU_PD_HP_AON_PD_MASK    0x0000001FU
#define PMU_PD_HP_AON_PD_MASK_M  (PMU_PD_HP_AON_PD_MASK_V << PMU_PD_HP_AON_PD_MASK_S)
#define PMU_PD_HP_AON_PD_MASK_V  0x0000001FU
#define PMU_PD_HP_AON_PD_MASK_S  27

/** PMU_POWER_PD_HPCPU_CNTL_REG register
 *  Configuration register for CPU power domain controlled by PMU
 */
#define PMU_POWER_PD_HPCPU_CNTL_REG (DR_REG_PMU_BASE + 0x100)
/** PMU_FORCE_HP_CPU_RESET : R/W; bitpos: [0]; default: 0;
 *  Configures whether or not to force reset CPU domain.
 *  0: No effect
 *  1: Force reset
 */
#define PMU_FORCE_HP_CPU_RESET    (BIT(0))
#define PMU_FORCE_HP_CPU_RESET_M  (PMU_FORCE_HP_CPU_RESET_V << PMU_FORCE_HP_CPU_RESET_S)
#define PMU_FORCE_HP_CPU_RESET_V  0x00000001U
#define PMU_FORCE_HP_CPU_RESET_S  0
/** PMU_FORCE_HP_CPU_ISO : R/W; bitpos: [1]; default: 0;
 *  Configures whether or not to enable the force isolation of CPU domain.
 *  0: No effect
 *  1: Enable
 */
#define PMU_FORCE_HP_CPU_ISO    (BIT(1))
#define PMU_FORCE_HP_CPU_ISO_M  (PMU_FORCE_HP_CPU_ISO_V << PMU_FORCE_HP_CPU_ISO_S)
#define PMU_FORCE_HP_CPU_ISO_V  0x00000001U
#define PMU_FORCE_HP_CPU_ISO_S  1
/** PMU_FORCE_HP_CPU_PU : R/W; bitpos: [2]; default: 1;
 *  Configures whether or not to force power up CPU domain. This setting has a lower priority than PMU_PD_HP_CPU_MASK.
 *  0: No effect
 *  1: Force power up
 */
#define PMU_FORCE_HP_CPU_PU    (BIT(2))
#define PMU_FORCE_HP_CPU_PU_M  (PMU_FORCE_HP_CPU_PU_V << PMU_FORCE_HP_CPU_PU_S)
#define PMU_FORCE_HP_CPU_PU_V  0x00000001U
#define PMU_FORCE_HP_CPU_PU_S  2
/** PMU_FORCE_HP_CPU_NO_RESET : R/W; bitpos: [3]; default: 1;
 *  Configures whether or not to forcefully prevent the reset of CPU domain. This setting has a lower priority than PMU_FORCE_HP_CPU_RESET.
 *  0: No effect
 *  1: Force not reset
 */
#define PMU_FORCE_HP_CPU_NO_RESET    (BIT(3))
#define PMU_FORCE_HP_CPU_NO_RESET_M  (PMU_FORCE_HP_CPU_NO_RESET_V << PMU_FORCE_HP_CPU_NO_RESET_S)
#define PMU_FORCE_HP_CPU_NO_RESET_V  0x00000001U
#define PMU_FORCE_HP_CPU_NO_RESET_S  3
/** PMU_FORCE_HP_CPU_NO_ISO : R/W; bitpos: [4]; default: 1;
 *  Configures whether or not to disable the force isolation of CPU domain. This setting has a lower priority than PMU_FORCE_HP_CPU_ISO.
 *  0: No effect
 *  1: Disable
 */
#define PMU_FORCE_HP_CPU_NO_ISO    (BIT(4))
#define PMU_FORCE_HP_CPU_NO_ISO_M  (PMU_FORCE_HP_CPU_NO_ISO_V << PMU_FORCE_HP_CPU_NO_ISO_S)
#define PMU_FORCE_HP_CPU_NO_ISO_V  0x00000001U
#define PMU_FORCE_HP_CPU_NO_ISO_S  4
/** PMU_FORCE_HP_CPU_PD : R/W; bitpos: [5]; default: 0;
 *  Configures whether or not to force power down CPU domain. This setting has a lower priority than PMU_FORCE_HP_CPU_PU.
 *  0: No effect
 *  1: Force power down
 */
#define PMU_FORCE_HP_CPU_PD    (BIT(5))
#define PMU_FORCE_HP_CPU_PD_M  (PMU_FORCE_HP_CPU_PD_V << PMU_FORCE_HP_CPU_PD_S)
#define PMU_FORCE_HP_CPU_PD_V  0x00000001U
#define PMU_FORCE_HP_CPU_PD_S  5
/** PMU_PD_HP_CPU_MASK : R/W; bitpos: [10:6]; default: 0;
 *  Configures whether or not to force power up CPU domain, regardless the signals from PMU.
 *  0: No effect
 *  1: Force power up
 */
#define PMU_PD_HP_CPU_MASK    0x0000001FU
#define PMU_PD_HP_CPU_MASK_M  (PMU_PD_HP_CPU_MASK_V << PMU_PD_HP_CPU_MASK_S)
#define PMU_PD_HP_CPU_MASK_V  0x0000001FU
#define PMU_PD_HP_CPU_MASK_S  6
/** PMU_PD_HP_CPU_PD_MASK : R/W; bitpos: [31:27]; default: 0;
 *  Configures whether or not to force power down CPU domain, regardless the signals from PMU. This setting has a lower priority than PMU_PD_HP_CPU_MASK.
 *  0: No effect
 *  1: Force power up
 */
#define PMU_PD_HP_CPU_PD_MASK    0x0000001FU
#define PMU_PD_HP_CPU_PD_MASK_M  (PMU_PD_HP_CPU_PD_MASK_V << PMU_PD_HP_CPU_PD_MASK_S)
#define PMU_PD_HP_CPU_PD_MASK_V  0x0000001FU
#define PMU_PD_HP_CPU_PD_MASK_S  27

