espressif/esp-idf/components/soc/esp32c61/register/soc/pmu_reg.h
/** PMU_POWER_PD_HPPERI_CNTL_REG register
 *  need_des
 */
#define PMU_POWER_PD_HPPERI_CNTL_REG (DR_REG_PMU_BASE + 0x104)
/** PMU_FORCE_HP_PERI_RESET : R/W; bitpos: [0]; default: 0;
 *  need_des
 */
#define PMU_FORCE_HP_PERI_RESET    (BIT(0))
#define PMU_FORCE_HP_PERI_RESET_M  (PMU_FORCE_HP_PERI_RESET_V << PMU_FORCE_HP_PERI_RESET_S)
#define PMU_FORCE_HP_PERI_RESET_V  0x00000001U
#define PMU_FORCE_HP_PERI_RESET_S  0
/** PMU_FORCE_HP_PERI_ISO : R/W; bitpos: [1]; default: 0;
 *  need_des
 */
#define PMU_FORCE_HP_PERI_ISO    (BIT(1))
#define PMU_FORCE_HP_PERI_ISO_M  (PMU_FORCE_HP_PERI_ISO_V << PMU_FORCE_HP_PERI_ISO_S)
#define PMU_FORCE_HP_PERI_ISO_V  0x00000001U
#define PMU_FORCE_HP_PERI_ISO_S  1
/** PMU_FORCE_HP_PERI_PU : R/W; bitpos: [2]; default: 1;
 *  need_des
 */
#define PMU_FORCE_HP_PERI_PU    (BIT(2))
#define PMU_FORCE_HP_PERI_PU_M  (PMU_FORCE_HP_PERI_PU_V << PMU_FORCE_HP_PERI_PU_S)
#define PMU_FORCE_HP_PERI_PU_V  0x00000001U
#define PMU_FORCE_HP_PERI_PU_S  2
/** PMU_FORCE_HP_PERI_NO_RESET : R/W; bitpos: [3]; default: 1;
 *  need_des
 */
#define PMU_FORCE_HP_PERI_NO_RESET    (BIT(3))
#define PMU_FORCE_HP_PERI_NO_RESET_M  (PMU_FORCE_HP_PERI_NO_RESET_V << PMU_FORCE_HP_PERI_NO_RESET_S)
#define PMU_FORCE_HP_PERI_NO_RESET_V  0x00000001U
#define PMU_FORCE_HP_PERI_NO_RESET_S  3
/** PMU_FORCE_HP_PERI_NO_ISO : R/W; bitpos: [4]; default: 1;
 *  need_des
 */
#define PMU_FORCE_HP_PERI_NO_ISO    (BIT(4))
#define PMU_FORCE_HP_PERI_NO_ISO_M  (PMU_FORCE_HP_PERI_NO_ISO_V << PMU_FORCE_HP_PERI_NO_ISO_S)
#define PMU_FORCE_HP_PERI_NO_ISO_V  0x00000001U
#define PMU_FORCE_HP_PERI_NO_ISO_S  4
/** PMU_FORCE_HP_PERI_PD : R/W; bitpos: [5]; default: 0;
 *  need_des
 */
#define PMU_FORCE_HP_PERI_PD    (BIT(5))
#define PMU_FORCE_HP_PERI_PD_M  (PMU_FORCE_HP_PERI_PD_V << PMU_FORCE_HP_PERI_PD_S)
#define PMU_FORCE_HP_PERI_PD_V  0x00000001U
#define PMU_FORCE_HP_PERI_PD_S  5
/** PMU_PD_HP_PERI_MASK : R/W; bitpos: [10:6]; default: 0;
 *  need_des
 */
#define PMU_PD_HP_PERI_MASK    0x0000001FU
#define PMU_PD_HP_PERI_MASK_M  (PMU_PD_HP_PERI_MASK_V << PMU_PD_HP_PERI_MASK_S)
#define PMU_PD_HP_PERI_MASK_V  0x0000001FU
#define PMU_PD_HP_PERI_MASK_S  6
/** PMU_PD_HP_PERI_PD_MASK : R/W; bitpos: [31:27]; default: 0;
 *  need_des
 */
#define PMU_PD_HP_PERI_PD_MASK    0x0000001FU
#define PMU_PD_HP_PERI_PD_MASK_M  (PMU_PD_HP_PERI_PD_MASK_V << PMU_PD_HP_PERI_PD_MASK_S)
#define PMU_PD_HP_PERI_PD_MASK_V  0x0000001FU
#define PMU_PD_HP_PERI_PD_MASK_S  27

/** PMU_POWER_PD_HPWIFI_CNTL_REG register
 *  Configuration register for MODEM power domain controlled by PMU
 */
#define PMU_POWER_PD_HPWIFI_CNTL_REG (DR_REG_PMU_BASE + 0x108)
/** PMU_FORCE_HP_WIFI_RESET : R/W; bitpos: [0]; default: 0;
 *  Configures whether or not to force reset MODEM domain.
 *  0: No effect
 *  1: Force reset
 */
#define PMU_FORCE_HP_WIFI_RESET    (BIT(0))
#define PMU_FORCE_HP_WIFI_RESET_M  (PMU_FORCE_HP_WIFI_RESET_V << PMU_FORCE_HP_WIFI_RESET_S)
#define PMU_FORCE_HP_WIFI_RESET_V  0x00000001U
#define PMU_FORCE_HP_WIFI_RESET_S  0
/** PMU_FORCE_HP_WIFI_ISO : R/W; bitpos: [1]; default: 0;
 *  Configures whether or not to enable the force isolation of MODEM domain.
 *  0: No effect
 *  1: Enable
 */
#define PMU_FORCE_HP_WIFI_ISO    (BIT(1))
#define PMU_FORCE_HP_WIFI_ISO_M  (PMU_FORCE_HP_WIFI_ISO_V << PMU_FORCE_HP_WIFI_ISO_S)
#define PMU_FORCE_HP_WIFI_ISO_V  0x00000001U
#define PMU_FORCE_HP_WIFI_ISO_S  1
/** PMU_FORCE_HP_WIFI_PU : R/W; bitpos: [2]; default: 1;
 *  Configures whether or not to force power up MODEM domain. This setting has a lower priority than PMU_PD_HP_WIFI_MASK.
 *  0: No effect
 *  1: Force power up
 */
#define PMU_FORCE_HP_WIFI_PU    (BIT(2))
#define PMU_FORCE_HP_WIFI_PU_M  (PMU_FORCE_HP_WIFI_PU_V << PMU_FORCE_HP_WIFI_PU_S)
#define PMU_FORCE_HP_WIFI_PU_V  0x00000001U
#define PMU_FORCE_HP_WIFI_PU_S  2
/** PMU_FORCE_HP_WIFI_NO_RESET : R/W; bitpos: [3]; default: 1;
 *  Configures whether or not to forcefully prevent the reset of MODEM domain. This setting has a lower priority than PMU_FORCE_HP_WIFI_RESET.
 *  0: No effect
 *  1: Force not reset
 */
#define PMU_FORCE_HP_WIFI_NO_RESET    (BIT(3))
#define PMU_FORCE_HP_WIFI_NO_RESET_M  (PMU_FORCE_HP_WIFI_NO_RESET_V << PMU_FORCE_HP_WIFI_NO_RESET_S)
#define PMU_FORCE_HP_WIFI_NO_RESET_V  0x00000001U
#define PMU_FORCE_HP_WIFI_NO_RESET_S  3
/** PMU_FORCE_HP_WIFI_NO_ISO : R/W; bitpos: [4]; default: 1;
 *  Configures whether or not to disable the force isolation of MODEM domain. This setting has a lower priority than PMU_FORCE_HP_WIFI_ISO.
 *  0: No effect
 *  1: Disable
 */
#define PMU_FORCE_HP_WIFI_NO_ISO    (BIT(4))
#define PMU_FORCE_HP_WIFI_NO_ISO_M  (PMU_FORCE_HP_WIFI_NO_ISO_V << PMU_FORCE_HP_WIFI_NO_ISO_S)
#define PMU_FORCE_HP_WIFI_NO_ISO_V  0x00000001U
#define PMU_FORCE_HP_WIFI_NO_ISO_S  4
/** PMU_FORCE_HP_WIFI_PD : R/W; bitpos: [5]; default: 0;
 *  Configures whether or not to force power down MODEM domain. This setting has a lower priority than PMU_FORCE_HP_WIFI_PU.
 *  0: No effect
 *  1: Force power down
 */
#define PMU_FORCE_HP_WIFI_PD    (BIT(5))
#define PMU_FORCE_HP_WIFI_PD_M  (PMU_FORCE_HP_WIFI_PD_V << PMU_FORCE_HP_WIFI_PD_S)
#define PMU_FORCE_HP_WIFI_PD_V  0x00000001U
#define PMU_FORCE_HP_WIFI_PD_S  5
/** PMU_PD_HP_WIFI_MASK : R/W; bitpos: [10:6]; default: 0;
 *  Configures whether or not to force power up MODEM domain, regardless the signals from PMU.
 *  0: No effect
 *  1: Force power up
 */
#define PMU_PD_HP_WIFI_MASK    0x0000001FU
#define PMU_PD_HP_WIFI_MASK_M  (PMU_PD_HP_WIFI_MASK_V << PMU_PD_HP_WIFI_MASK_S)
#define PMU_PD_HP_WIFI_MASK_V  0x0000001FU
#define PMU_PD_HP_WIFI_MASK_S  6
/** PMU_PD_HP_WIFI_PD_MASK : R/W; bitpos: [31:27]; default: 0;
 *  Configures whether or not to force power down MODEM domain, regardless the signals from PMU. This setting has a lower priority than PMU_PD_HP_WIFI_MASK.
 *  0: No effect
 *  1: Force power up
 */
#define PMU_PD_HP_WIFI_PD_MASK    0x0000001FU
#define PMU_PD_HP_WIFI_PD_MASK_M  (PMU_PD_HP_WIFI_PD_MASK_V << PMU_PD_HP_WIFI_PD_MASK_S)
#define PMU_PD_HP_WIFI_PD_MASK_V  0x0000001FU
#define PMU_PD_HP_WIFI_PD_MASK_S  27

/** PMU_POWER_PD_LPPERI_CNTL_REG register
 *  Configuration register for LPSYS_OFF power domain controlled by PMU
 */
#define PMU_POWER_PD_LPPERI_CNTL_REG (DR_REG_PMU_BASE + 0x10c)
/** PMU_FORCE_LP_PERI_RESET : R/W; bitpos: [0]; default: 0;
 *  Configures whether or not to force reset LPSYS_OFF domain.
 *  0: No effect
 *  1: Force reset
 */
#define PMU_FORCE_LP_PERI_RESET    (BIT(0))
#define PMU_FORCE_LP_PERI_RESET_M  (PMU_FORCE_LP_PERI_RESET_V << PMU_FORCE_LP_PERI_RESET_S)
#define PMU_FORCE_LP_PERI_RESET_V  0x00000001U
#define PMU_FORCE_LP_PERI_RESET_S  0
/** PMU_FORCE_LP_PERI_ISO : R/W; bitpos: [1]; default: 0;
 *  Configures whether or not to enable the force isolation of LPSYS_OFF domain.
 *  0: No effect
 *  1: Enable
 */
#define PMU_FORCE_LP_PERI_ISO    (BIT(1))
#define PMU_FORCE_LP_PERI_ISO_M  (PMU_FORCE_LP_PERI_ISO_V << PMU_FORCE_LP_PERI_ISO_S)
#define PMU_FORCE_LP_PERI_ISO_V  0x00000001U
#define PMU_FORCE_LP_PERI_ISO_S  1
/** PMU_FORCE_LP_PERI_PU : R/W; bitpos: [2]; default: 1;
 *  Configures whether or not to force power up LPSYS_OFF domain.
 *  0: No effect
 *  1: Force power up
 */
#define PMU_FORCE_LP_PERI_PU    (BIT(2))
#define PMU_FORCE_LP_PERI_PU_M  (PMU_FORCE_LP_PERI_PU_V << PMU_FORCE_LP_PERI_PU_S)
#define PMU_FORCE_LP_PERI_PU_V  0x00000001U
#define PMU_FORCE_LP_PERI_PU_S  2
/** PMU_FORCE_LP_PERI_NO_RESET : R/W; bitpos: [3]; default: 1;
 *  Configures whether or not to forcefully prevent the reset of LPSYS_OFF domain. This setting has a lower priority than PMU_FORCE_LP_PERI_RESET.
 *  0: No effect
 *  1: Force not reset
 */
#define PMU_FORCE_LP_PERI_NO_RESET    (BIT(3))
#define PMU_FORCE_LP_PERI_NO_RESET_M  (PMU_FORCE_LP_PERI_NO_RESET_V << PMU_FORCE_LP_PERI_NO_RESET_S)
#define PMU_FORCE_LP_PERI_NO_RESET_V  0x00000001U
#define PMU_FORCE_LP_PERI_NO_RESET_S  3
/** PMU_FORCE_LP_PERI_NO_ISO : R/W; bitpos: [4]; default: 1;
 *  Configures whether or not to disable the force isolation of LPSYS_OFF domain. This setting has a lower priority than PMU_FORCE_LP_PERI_ISO.
 *  0: No effect
 *  1: Disable
 */
#define PMU_FORCE_LP_PERI_NO_ISO    (BIT(4))
#define PMU_FORCE_LP_PERI_NO_ISO_M  (PMU_FORCE_LP_PERI_NO_ISO_V << PMU_FORCE_LP_PERI_NO_ISO_S)
#define PMU_FORCE_LP_PERI_NO_ISO_V  0x00000001U
#define PMU_FORCE_LP_PERI_NO_ISO_S  4
/** PMU_FORCE_LP_PERI_PD : R/W; bitpos: [5]; default: 0;
 *  Configures whether or not to force power down LPSYS_OFF domain. This setting has a lower priority than PMU_FORCE_LP_PERI_PU.
 *  0: No effect
 *  1: Force power down
 */
#define PMU_FORCE_LP_PERI_PD    (BIT(5))
#define PMU_FORCE_LP_PERI_PD_M  (PMU_FORCE_LP_PERI_PD_V << PMU_FORCE_LP_PERI_PD_S)
#define PMU_FORCE_LP_PERI_PD_V  0x00000001U
#define PMU_FORCE_LP_PERI_PD_S  5

/** PMU_POWER_PD_MEM_CNTL_REG register
 *  Configuration register for Internal SRAMx power domain's ISO and overall switch controlled by PMU
 */
#define PMU_POWER_PD_MEM_CNTL_REG (DR_REG_PMU_BASE + 0x110)
/** PMU_FORCE_HP_MEM_ISO : R/W; bitpos: [3:0]; default: 0;
 *  Configures whether or not to enable the force isolation of Internal SRAMx domain.
 *  0: No effect
 *  1: Enable
 */
#define PMU_FORCE_HP_MEM_ISO    0x0000000FU
#define PMU_FORCE_HP_MEM_ISO_M  (PMU_FORCE_HP_MEM_ISO_V << PMU_FORCE_HP_MEM_ISO_S)
#define PMU_FORCE_HP_MEM_ISO_V  0x0000000FU
#define PMU_FORCE_HP_MEM_ISO_S  0
/** PMU_FORCE_HP_MEM_PD : R/W; bitpos: [7:4]; default: 0;
 *  Configures whether or not to force power down Internal SRAMx domain. This setting has a lower priority than PMU_FORCE_HP_MEM_PU.
 *  0: No effect
 *  1: Force power down
 */
#define PMU_FORCE_HP_MEM_PD    0x0000000FU
#define PMU_FORCE_HP_MEM_PD_M  (PMU_FORCE_HP_MEM_PD_V << PMU_FORCE_HP_MEM_PD_S)
#define PMU_FORCE_HP_MEM_PD_V  0x0000000FU
#define PMU_FORCE_HP_MEM_PD_S  4
/** PMU_FORCE_HP_MEM_NO_ISO : R/W; bitpos: [27:24]; default: 15;
 *  Configures whether or not to disable the force isolation of Internal SRAMx domain. This setting has a lower priority than PMU_FORCE_HP_MEM_ISO.
 *  0: No effect
 *  1: Disable
 */
#define PMU_FORCE_HP_MEM_NO_ISO    0x0000000FU
#define PMU_FORCE_HP_MEM_NO_ISO_M  (PMU_FORCE_HP_MEM_NO_ISO_V << PMU_FORCE_HP_MEM_NO_ISO_S)
#define PMU_FORCE_HP_MEM_NO_ISO_V  0x0000000FU
#define PMU_FORCE_HP_MEM_NO_ISO_S  24
/** PMU_FORCE_HP_MEM_PU : R/W; bitpos: [31:28]; default: 15;
 *  Configures whether or not to force power up Internal SRAMx domain. This setting has a lower priority than PMU_PD_HP_AON_MASK.
 *  0: No effect
 *  1: Force power up
 */
#define PMU_FORCE_HP_MEM_PU    0x0000000FU
#define PMU_FORCE_HP_MEM_PU_M  (PMU_FORCE_HP_MEM_PU_V << PMU_FORCE_HP_MEM_PU_S)
#define PMU_FORCE_HP_MEM_PU_V  0x0000000FU
#define PMU_FORCE_HP_MEM_PU_S  28

/** PMU_POWER_PD_MEM_MASK_REG register
 *  Configuration register for LDO switch of individual Internal SRAMx power supply controlled by PMU
 */
#define PMU_POWER_PD_MEM_MASK_REG (DR_REG_PMU_BASE + 0x114)
/** PMU_PD_HP_MEM2_PD_MASK : R/W; bitpos: [4:0]; default: 0;
 *  Configures whether the Internal SRAM2 follows the power up/down state of Peripherals+ROM domain.
 *  0: Follows Peripherals+ROM domain
 *  1: Does not follow Peripherals+ROM domain.
 */
#define PMU_PD_HP_MEM2_PD_MASK    0x0000001FU
#define PMU_PD_HP_MEM2_PD_MASK_M  (PMU_PD_HP_MEM2_PD_MASK_V << PMU_PD_HP_MEM2_PD_MASK_S)
#define PMU_PD_HP_MEM2_PD_MASK_V  0x0000001FU
#define PMU_PD_HP_MEM2_PD_MASK_S  0
/** PMU_PD_HP_MEM1_PD_MASK : R/W; bitpos: [9:5]; default: 0;
 *  Configures whether the Internal SRAM1 follows the power up/down state of Peripherals+ROM domain.
 *  0: Follows Peripherals+ROM domain
 *  1: Does not follow Peripherals+ROM domain.
 */
#define PMU_PD_HP_MEM1_PD_MASK    0x0000001FU
#define PMU_PD_HP_MEM1_PD_MASK_M  (PMU_PD_HP_MEM1_PD_MASK_V << PMU_PD_HP_MEM1_PD_MASK_S)
#define PMU_PD_HP_MEM1_PD_MASK_V  0x0000001FU
#define PMU_PD_HP_MEM1_PD_MASK_S  5
/** PMU_PD_HP_MEM0_PD_MASK : R/W; bitpos: [14:10]; default: 0;
 *  Configures whether the Internal SRAM0 follows the power up/down state of Peripherals+ROM domain.
 *  0: Follows Peripherals+ROM domain
 *  1: Does not follow Peripherals+ROM domain.
 */
#define PMU_PD_HP_MEM0_PD_MASK    0x0000001FU
#define PMU_PD_HP_MEM0_PD_MASK_M  (PMU_PD_HP_MEM0_PD_MASK_V << PMU_PD_HP_MEM0_PD_MASK_S)
#define PMU_PD_HP_MEM0_PD_MASK_V  0x0000001FU
#define PMU_PD_HP_MEM0_PD_MASK_S  10
/** PMU_PD_HP_MEM2_MASK : R/W; bitpos: [21:17]; default: 0;
 *  Configures whether to force power up Internal SRAM2.
 *  0: Do not force power up
 *  1: Force power up
 */
#define PMU_PD_HP_MEM2_MASK    0x0000001FU
#define PMU_PD_HP_MEM2_MASK_M  (PMU_PD_HP_MEM2_MASK_V << PMU_PD_HP_MEM2_MASK_S)
#define PMU_PD_HP_MEM2_MASK_V  0x0000001FU
#define PMU_PD_HP_MEM2_MASK_S  17
/** PMU_PD_HP_MEM1_MASK : R/W; bitpos: [26:22]; default: 0;
 *  Configures whether to to force power up Internal SRAM1.
 *  0: Do not force power up
 *  1: Force power up
 */
#define PMU_PD_HP_MEM1_MASK    0x0000001FU
#define PMU_PD_HP_MEM1_MASK_M  (PMU_PD_HP_MEM1_MASK_V << PMU_PD_HP_MEM1_MASK_S)
#define PMU_PD_HP_MEM1_MASK_V  0x0000001FU
#define PMU_PD_HP_MEM1_MASK_S  22
/** PMU_PD_HP_MEM0_MASK : R/W; bitpos: [31:27]; default: 0;
 *  Configures whether to force power up Internal SRAM0.
 *  0: Do not force power up
 *  1: Force power up
 */
#define PMU_PD_HP_MEM0_MASK    0x0000001FU
#define PMU_PD_HP_MEM0_MASK_M  (PMU_PD_HP_MEM0_MASK_V << PMU_PD_HP_MEM0_MASK_S)
#define PMU_PD_HP_MEM0_MASK_V  0x0000001FU
#define PMU_PD_HP_MEM0_MASK_S  27

/** PMU_POWER_HP_PAD_REG register
 *  Configuration register for HP GPIOs power supply controlled by PMU
 */
#define PMU_POWER_HP_PAD_REG (DR_REG_PMU_BASE + 0x118)
/** PMU_FORCE_HP_PAD_NO_ISO_ALL : R/W; bitpos: [0]; default: 0;
 *  Configures whether or not to disable HP GPIOs to enable ISO signal. This setting has a lower priority than PMU_FORCE_HP_PAD_ISO_ALL.
 *  0: No effect
 *  1: Disable
 */
#define PMU_FORCE_HP_PAD_NO_ISO_ALL    (BIT(0))
#define PMU_FORCE_HP_PAD_NO_ISO_ALL_M  (PMU_FORCE_HP_PAD_NO_ISO_ALL_V << PMU_FORCE_HP_PAD_NO_ISO_ALL_S)
#define PMU_FORCE_HP_PAD_NO_ISO_ALL_V  0x00000001U
#define PMU_FORCE_HP_PAD_NO_ISO_ALL_S  0
/** PMU_FORCE_HP_PAD_ISO_ALL : R/W; bitpos: [1]; default: 0;
 *  Configures whether or not to enable HP GPIOs to enable ISO signal. This setting has a higher priority than PMU_FORCE_HP_PAD_NO_ISO_ALL.
 *  0: No effect
 *  1: Enable
 */
#define PMU_FORCE_HP_PAD_ISO_ALL    (BIT(1))
#define PMU_FORCE_HP_PAD_ISO_ALL_M  (PMU_FORCE_HP_PAD_ISO_ALL_V << PMU_FORCE_HP_PAD_ISO_ALL_S)
#define PMU_FORCE_HP_PAD_ISO_ALL_V  0x00000001U
#define PMU_FORCE_HP_PAD_ISO_ALL_S  1

/** PMU_POWER_VDD_SPI_CNTL_REG register
 *  Configuration register for VDD_SPI power supply controlled by PMU
 */
#define PMU_POWER_VDD_SPI_CNTL_REG (DR_REG_PMU_BASE + 0x11c)
/** PMU_VDD_SPI_PWR_WAIT : R/W; bitpos: [28:18]; default: 255;
 *  Configures the number of cycles to delay before powering up or down the VDD_SPI cell.
 */
#define PMU_VDD_SPI_PWR_WAIT    0x000007FFU
#define PMU_VDD_SPI_PWR_WAIT_M  (PMU_VDD_SPI_PWR_WAIT_V << PMU_VDD_SPI_PWR_WAIT_S)
#define PMU_VDD_SPI_PWR_WAIT_V  0x000007FFU
#define PMU_VDD_SPI_PWR_WAIT_S  18
/** PMU_VDD_SPI_PWR_SW : R/W; bitpos: [30:29]; default: 3;
 *  Configure the power switch signal of VDD_SPI cell of HP GPIOs.
 */
#define PMU_VDD_SPI_PWR_SW    0x00000003U
#define PMU_VDD_SPI_PWR_SW_M  (PMU_VDD_SPI_PWR_SW_V << PMU_VDD_SPI_PWR_SW_S)
#define PMU_VDD_SPI_PWR_SW_V  0x00000003U
#define PMU_VDD_SPI_PWR_SW_S  29
/** PMU_VDD_SPI_PWR_SEL_SW : R/W; bitpos: [31]; default: 0;
 *  Configure to select the power switch control signals of VDD_SPI cell of HP GPIOs.
 *  0: controlled by PMU
 *  1: controlled by PMU_VDD_SPI_PWR_SW
 */
#define PMU_VDD_SPI_PWR_SEL_SW    (BIT(31))
#define PMU_VDD_SPI_PWR_SEL_SW_M  (PMU_VDD_SPI_PWR_SEL_SW_V << PMU_VDD_SPI_PWR_SEL_SW_S)
#define PMU_VDD_SPI_PWR_SEL_SW_V  0x00000001U
#define PMU_VDD_SPI_PWR_SEL_SW_S  31

/** PMU_POWER_CK_WAIT_CNTL_REG register
 *  Configuration register for system waiting time after clock change controlled by PMU
 */
#define PMU_POWER_CK_WAIT_CNTL_REG (DR_REG_PMU_BASE + 0x120)
/** PMU_WAIT_XTL_STABLE : R/W; bitpos: [15:0]; default: 256;
 *  Configures the number of CLK_DYN_FAST_CLK cycles to delay the XTAL_CLK gate opening after XTAL_CLK powers up, ensuring clock stability during startup.
 */
#define PMU_WAIT_XTL_STABLE    0x0000FFFFU
#define PMU_WAIT_XTL_STABLE_M  (PMU_WAIT_XTL_STABLE_V << PMU_WAIT_XTL_STABLE_S)
#define PMU_WAIT_XTL_STABLE_V  0x0000FFFFU
#define PMU_WAIT_XTL_STABLE_S  0
/** PMU_WAIT_PLL_STABLE : R/W; bitpos: [31:16]; default: 256;
 *  Configures the number of CLK_DYN_FAST_CLK cycles to delay the PLL_CLK gate opening after PLL_CLK powers up, ensuring clock stability during startup.
 */
#define PMU_WAIT_PLL_STABLE    0x0000FFFFU
#define PMU_WAIT_PLL_STABLE_M  (PMU_WAIT_PLL_STABLE_V << PMU_WAIT_PLL_STABLE_S)
#define PMU_WAIT_PLL_STABLE_V  0x0000FFFFU
#define PMU_WAIT_PLL_STABLE_S  16

